[{"name": "Pakistan", "latitude": 30.3753, "longitude": 69.3451, "fact": "Created in 1947 from the partition of British India, leading to one of the largest mass migrations in history.", "type": "country", "color": "#ffcccc", "text_color": "#800000"}, {"name": "Afghanistan", "latitude": 33.9391, "longitude": 67.71, "fact": "Shares a short border with India via the Wakhan Corridor, a region historically significant for trade routes like the Silk Road.", "type": "country", "color": "#ccffcc", "text_color": "#004d00"}, {"name": "China", "latitude": 35.8617, "longitude": 104.1954, "fact": "The border with India, largely defined by the Himalayas, has been subject to disputes, notably leading to the Sino-Indian War of 1962.", "type": "country", "color": "#ccccff", "text_color": "#000080"}, {"name": "Nepal", "latitude": 28.3949, "longitude": 84.124, "fact": "A landlocked country situated largely in the Himalayas, Nepal and India share deep cultural and religious ties, formalized by the 1950 Indo-Nepal Treaty of Peace and Friendship.", "type": "country", "color": "#ffffcc", "text_color": "#806600"}, {"name": "Bhutan", "latitude": 27.5142, "longitude": 90.4336, "fact": "A kingdom known for its Gross National Happiness index, Bhutan's foreign policy and defense were guided by India following treaties signed in 1949 and updated in 2007.", "type": "country", "color": "#ffccff", "text_color": "#660066"}, {"name": "Bangladesh", "latitude": 23.685, "longitude": 90.3563, "fact": "Formerly East Pakistan, Bangladesh gained independence in 1971 after the Liberation War, in which India played a significant supportive role. It shares the longest land border with India.", "type": "country", "color": "#ccffff", "text_color": "#006666"}, {"name": "Myanmar", "latitude": 21.9162, "longitude": 95.956, "fact": "Formerly known as Burma, it was administered as a province of British India until 1937. The border region has historical significance relating to WWII campaigns.", "type": "country", "color": "#ffddcc", "text_color": "#804000"}]